src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <registerRecords>AccumulationRegister.Задолженности</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Задолженности/Задолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Задолженности</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентДанные = Объект.Контрагент;
	
	Если ЗначениеЗаполнено(КонтрагентДанные) Тогда
		Объект.Сумма = КонтрагентПриИзмененииНаСервере(КонтрагентДанные);
	Иначе
		Объект.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КонтрагентПриИзмененииНаСервере(Контрагент)
	 ДолгиКонтрагента = РегистрыНакопления.Задолженности;
	 
	 ФильтрКонтр = Новый Структура;
	 ФильтрКонтр.Вставить("Контрагент", Контрагент);
	 
	 Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 ВременнойМомент = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
	 Иначе
		 ВременнойМомент = Неопределено;
	 КонецЕсли;
	 
	 ТаблицаДолг = ДолгиКонтрагента.Остатки(ВременнойМомент, ФильтрКонтр, "Контрагент", "СуммаДолга");
	 
	 ДолгСумма = ТаблицаДолг.Итог("СуммаДолга");
	 	 
	 Если ДолгСумма < 0 Тогда
	     Возврат -ДолгСумма;
	 Иначе
	     Возврат 0;
	 КонецЕсли;  
	 
КонецФункции
